turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X4C.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM3X4C-CU" package="LFBGA100" speedmax="84000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="ATSAM3X4C-AU" package="LQFP100" speedmax="84000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M3" family="SAM3" name="ATSAM3X4C" series="SAM3XA">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH0" start="0x00080000" size="0x00020000" type="flash" pagesize="256"/>
          <memory-segment name="IFLASH1" start="0xA0000" size="0x00020000" type="flash" pagesize="256"/>
          <memory-segment name="IROM" start="0x00100000" size="0x00100000" type="rom"/>
          <memory-segment name="IRAM0" start="0x20000000" size="0x00008000" type="ram" mirror-mask="0x78000"/>
          <memory-segment name="IRAM1" start="0x20080000" size="0x00008000" type="ram" mirror-mask="0x78000"/>
          <memory-segment name="NFC_RAM" start="0x20100000" size="0x00100000" type="other"/>
          <memory-segment name="UOTGHS_RAM" start="0x20180000" size="0x00100000" type="other"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS4" start="0x64000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS5" start="0x65000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS6" start="0x66000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS7" start="0x67000000" size="0x01000000" type="other"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="4" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x4" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ADC" version="6489Q">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x400C0000"/>
            <signals>
              <signal pad="PA11" function="B" group="ADTRG"/>
              <signal pad="PA2" function="X1" group="AD" index="0"/>
              <signal pad="PA3" function="X1" group="AD" index="1"/>
              <signal pad="PA3" function="X1" group="WKUP" index="1"/>
              <signal pad="PA4" function="X1" group="AD" index="2"/>
              <signal pad="PA6" function="X1" group="AD" index="3"/>
              <signal pad="PA22" function="X1" group="AD" index="4"/>
              <signal pad="PA23" function="X1" group="AD" index="5"/>
              <signal pad="PA24" function="X1" group="AD" index="6"/>
              <signal pad="PA16" function="X1" group="AD" index="7"/>
              <signal pad="PB12" function="X1" group="AD" index="8"/>
              <signal pad="PB13" function="X1" group="AD" index="9"/>
              <signal pad="PB17" function="X1" group="AD" index="10"/>
              <signal pad="PB18" function="X1" group="AD" index="11"/>
              <signal pad="PB19" function="X1" group="AD" index="12"/>
              <signal pad="PB20" function="X1" group="AD" index="13"/>
              <signal pad="PB21" function="X1" group="AD" index="14"/>
              <signal pad="PB21" function="X1" group="WKUP" index="13"/>
            </signals>
          </instance>
        </module>
