turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X4C.atdf
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protect Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Clock Enable Register 1" name="PMC_PCER1" offset="0x0100" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Enable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Enable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Enable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Enable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Enable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Enable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Enable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Enable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Enable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Enable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Enable" mask="0x00001000" name="PID44"/>
        </register>
        <register caption="Peripheral Clock Disable Register 1" name="PMC_PCDR1" offset="0x0104" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Disable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Disable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Disable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Disable" mask="0x00001000" name="PID44"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_PCSR1" offset="0x0108" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x010C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000003F" name="PID"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Divisor Value" mask="0x00030000" name="DIV" values="PMC_PCR__DIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
        </register>
      </register-group>
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="The Fast RC Oscillator Frequency is at 4 MHz (default)" name="_4_MHz" value="0x0"/>
        <value caption="The Fast RC Oscillator Frequency is at 8 MHz" name="_8_MHz" value="0x1"/>
        <value caption="The Fast RC Oscillator Frequency is at 12 MHz" name="_12_MHz" value="0x2"/>
      </value-group>
      <value-group caption="" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
      <value-group caption="" name="PMC_PCR__DIV">
        <value caption="Peripheral clock is MCK" name="PERIPH_DIV_MCK" value="0x0"/>
        <value caption="Peripheral clock is MCK/2" name="PERIPH_DIV2_MCK" value="0x1"/>
        <value caption="Peripheral clock is MCK/4" name="PERIPH_DIV4_MCK" value="0x2"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" version="6343J">
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x000000FF" name="DIVA"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x00000F00" name="PREA"/>
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x00FF0000" name="DIVB"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x0F000000" name="PREB"/>
        </register>
