turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X4C.atdf
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Channel ID" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Channel ID" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Channel ID" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Channel ID" mask="0x00000080" name="CHID7"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Channel ID" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Channel ID" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Channel ID" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Channel ID" mask="0x00000080" name="CHID7"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Channel ID" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Channel ID" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Channel ID" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Channel ID" mask="0x00000080" name="CHID7"/>
        </register>
        <register caption="PWM Interrupt Enable Register 1" name="PWM_IER1" offset="0x10" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Enable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Counter Event on Channel 4 Interrupt Enable" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Counter Event on Channel 5 Interrupt Enable" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Counter Event on Channel 6 Interrupt Enable" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Counter Event on Channel 7 Interrupt Enable" mask="0x00000080" name="CHID7"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable" mask="0x00080000" name="FCHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 4 Interrupt Enable" mask="0x00100000" name="FCHID4"/>
          <bitfield caption="Fault Protection Trigger on Channel 5 Interrupt Enable" mask="0x00200000" name="FCHID5"/>
          <bitfield caption="Fault Protection Trigger on Channel 6 Interrupt Enable" mask="0x00400000" name="FCHID6"/>
          <bitfield caption="Fault Protection Trigger on Channel 7 Interrupt Enable" mask="0x00800000" name="FCHID7"/>
        </register>
        <register caption="PWM Interrupt Disable Register 1" name="PWM_IDR1" offset="0x14" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Disable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Disable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Disable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Disable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Counter Event on Channel 4 Interrupt Disable" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Counter Event on Channel 5 Interrupt Disable" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Counter Event on Channel 6 Interrupt Disable" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Counter Event on Channel 7 Interrupt Disable" mask="0x00000080" name="CHID7"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Disable" mask="0x00080000" name="FCHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 4 Interrupt Disable" mask="0x00100000" name="FCHID4"/>
          <bitfield caption="Fault Protection Trigger on Channel 5 Interrupt Disable" mask="0x00200000" name="FCHID5"/>
          <bitfield caption="Fault Protection Trigger on Channel 6 Interrupt Disable" mask="0x00400000" name="FCHID6"/>
          <bitfield caption="Fault Protection Trigger on Channel 7 Interrupt Disable" mask="0x00800000" name="FCHID7"/>
        </register>
        <register caption="PWM Interrupt Mask Register 1" name="PWM_IMR1" offset="0x18" rw="R" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Mask" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Mask" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Mask" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Mask" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Counter Event on Channel 4 Interrupt Mask" mask="0x00000010" name="CHID4"/>
          <bitfield caption="Counter Event on Channel 5 Interrupt Mask" mask="0x00000020" name="CHID5"/>
          <bitfield caption="Counter Event on Channel 6 Interrupt Mask" mask="0x00000040" name="CHID6"/>
          <bitfield caption="Counter Event on Channel 7 Interrupt Mask" mask="0x00000080" name="CHID7"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Mask" mask="0x00080000" name="FCHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 4 Interrupt Mask" mask="0x00100000" name="FCHID4"/>
          <bitfield caption="Fault Protection Trigger on Channel 5 Interrupt Mask" mask="0x00200000" name="FCHID5"/>
          <bitfield caption="Fault Protection Trigger on Channel 6 Interrupt Mask" mask="0x00400000" name="FCHID6"/>
          <bitfield caption="Fault Protection Trigger on Channel 7 Interrupt Mask" mask="0x00800000" name="FCHID7"/>
        </register>
